In [1]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [10]:
# Ans
import pandas as pd

In [11]:
ds =pd.Series([4, 8, 15, 16, 23,42,])

In [12]:
print (ds)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [13]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
# variable print it.

In [14]:
# Ans
my_list=[1,2,3,4,5,6,7,8,9,10]

In [17]:
my_series=pd.Series(my_list)

In [18]:
print(my_series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [19]:
# Q3. Create a Pandas DataFrame that contains the following data:

In [21]:
# Ans
df=pd.DataFrame({'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']})

In [22]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [23]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [24]:
# Ans Data Frame= data frame is a two- dimesional table like data who consist multiple of column & rows. We can also say that
# the datafram is collection of series.
# Series= series i a one- dimesional array-that can hold data of a single data type.
# Example

In [25]:
pd.DataFrame({'name':['Saket','Rohit','mohit'],'age':[20,22,19],'city':['delhi','lucknow','ahmedabad']})

    name  age       city
0  Saket   20      delhi
1  Rohit   22    lucknow
2  mohit   19  ahmedabad

In [26]:
# above table is a data frame because its consist multiple row and columns 
pd.Series([2,4,5,6,7,8])

0    2
1    4
2    5
3    6
4    7
5    8
dtype: int64

In [27]:
# above data is a series because its consist single column

In [28]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?

In [30]:
# Ans Pandas provide many built-in function to manipulate the data. some of the functions are apply, loc $ iloc, 
# fillna, merge, join, drop etc. 
# Example

In [35]:
data=pd.DataFrame({'name':['Saket','Rohit','mohit','Chandan'],'age':[20,22,19,18],'city':['delhi','lucknow','ahmedabad','kolkata']})

In [36]:
data

      name  age       city
0    Saket   20      delhi
1    Rohit   22    lucknow
2    mohit   19  ahmedabad
3  Chandan   18    kolkata

In [39]:
data.drop(2)

      name  age     city
0    Saket   20    delhi
1    Rohit   22  lucknow
3  Chandan   18  kolkata

In [41]:
data.loc[0:2]

    name  age       city
0  Saket   20      delhi
1  Rohit   22    lucknow
2  mohit   19  ahmedabad

In [42]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [43]:
# When we say that Series and DataFrame are mutable, it means that we can modify their values, add or remove 
# rows or columns, or perform other operations that change the contents of the object.

In [44]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [45]:
# in pandas we create data frame using multiple series
books=pd.Series(['math','physics','chemistry','englis'])
marks=pd.Series([88,95,86,75])
grade=pd.Series(['A','A+','A','B+'])

In [46]:
df=pd.DataFrame({'books':books,'marks':marks,'grade':grade})

In [47]:
df

       books  marks grade
0       math     88     A
1    physics     95    A+
2  chemistry     86     A
3     englis     75    B+

In [48]:
# So now we can see that we can create the dataframe using multiple series